nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    DEBUG_PIN0_CLR
    DEBUG_PIN1_CLR

    hadm_hal_properties.prepareMaxUs = HADM_HAL_PREPARE_US;

    /*
     * FAST_RX2TX_START_FC and FAST_TX2RX_START_FC are actually TSM indexes (us) where TSM rewinds to start an FCS phase.
     * As a consequence, they represent the elapsed time between RSM start and the beginning of FCS phase for initiator and reflector respectively.
     * Note: FCS phase in the RSM does not include ramp down which occurs at the very end of a step in the TSM sequence.
     * Typical value is 25us (for both roles).
     */
    hadm_hal_properties.txWarmupUs = 14U + 2U; /* 14us RSM WU state duration + 2us digital latency for 1st bit to reach the air */
    hadm_hal_properties.txWarmupUs += ((xcvr_lcl_tsm_generic_config.WU_LATENCY & XCVR_TSM_WU_LATENCY_TX_DATAPATH_LATENCY_MASK) >> XCVR_TSM_WU_LATENCY_TX_DATAPATH_LATENCY_SHIFT);
    hadm_hal_properties.txWarmupUs += HADM_HAL_RSM_TRIGGER_OFFSET;

    hadm_hal_properties.rxWarmupUs = (uint16_t)((xcvr_lcl_tsm_generic_config.FAST_CTRL3 & XCVR_TSM_FAST_CTRL3_FAST_TX2RX_START_FC_MASK) >> XCVR_TSM_FAST_CTRL3_FAST_TX2RX_START_FC_SHIFT) + 1U; /* +1 as this is a count from 0 */
    hadm_hal_properties.rxWarmupUs += HADM_HAL_RSM_TRIGGER_OFFSET;

    for (i = 0; i < (int)HADM_MAX_NB_SIMULT_SUBEVENTS; i++)
    {
        /* Static initialization of PKT RAM buffers */
        hadm_meas[i].pkt_ram.step_config.ram_type = 0;
        hadm_meas[i].pkt_ram.step_config.buff_len = HADM_HAL_PKT_RAM_CONFIG_CIRC_BUFF_SIZE;
        hadm_meas[i].pkt_ram.step_config.base_ptr = (uint32_t *)(void *)TX_PACKET_RAM + (i * HADM_HAL_PKT_RAM_CONFIG_CIRC_BUFF_SIZE);
        assert((hadm_meas[i].pkt_ram.step_config.base_ptr + hadm_meas[i].pkt_ram.step_config.buff_len) <= (((uint32_t *)(void *)TX_PACKET_RAM) + TX_PACKET_RAM_PACKET_RAM_COUNT));
        hadm_meas[i].pkt_ram.step_result.ram_type = 1;
        hadm_meas[i].pkt_ram.step_result.buff_len = HADM_HAL_PKT_RAM_RESULT_CIRC_BUFF_SIZE;
        hadm_meas[i].pkt_ram.step_result.base_ptr = (uint32_t *)(void *)RX_PACKET_RAM + (i * HADM_HAL_PKT_RAM_RESULT_CIRC_BUFF_SIZE);
        assert((hadm_meas[i].pkt_ram.step_result.base_ptr + hadm_meas[i].pkt_ram.step_result.buff_len) <= (((uint32_t *)(void *)RX_PACKET_RAM) + RX_PACKET_RAM_PACKET_RAM_COUNT));

        lcl_hadm_free_meas_instance(&hadm_meas[i]);
        
        /* Static initialization of RSM XCVR config (will be updated by ConfigApply() API) */
        hadm_meas[i].rsm_config.sniffer_mode_en = 0;
        hadm_meas[i].rsm_config.trig_sel = (XCVR_RSM_TRIG_T)6U; /* 110b - nbu trigger */
        hadm_meas[i].rsm_config.rxdig_dly = 0U;
        hadm_meas[i].rsm_config.txdig_dly = 0U;
        hadm_meas[i].rsm_config.use_rsm_dma_mask = false, /* disable dma_mask */
#if defined(SUPPORT_RSM_LONG_PN) && (SUPPORT_RSM_LONG_PN == 1)
        hadm_meas[i].rsm_config.rtt_len = XCVR_RSM_SQTE_PN32,
#endif /* defined(SUPPORT_RSM_LONG_PN) && (SUPPORT_RSM_LONG_PN == 1) */
        hadm_meas[i].rsm_config.rsm_dma_dly_pm = 0U,
        hadm_meas[i].rsm_config.rsm_dma_dur_pm = 0U,
        hadm_meas[i].rsm_config.pct_averaging_win = XCVR_RSM_PCT_AVG_WIN_4_SMPL;
        hadm_meas[i].rsm_config.disable_rx_sync = false;
        hadm_meas[i].rsm_config.iq_out_sel = XCVR_RSM_IQ_OUT_FRAC_CORR;

        /* Clear working variables */
        hadm_meas[i].debug_flags = 0;
        hadm_meas[i].iq_avg_win = 0;
        hadm_meas[i].iq_capture_win = 0;
        hadm_meas[i].num_ant = 0;
        hadm_meas[i].n_ap = 0;
        hadm_meas[i].iq_buff_size = 0;
        hadm_meas[i].iq_buff_size_mode0 = 0;
    }

    hadm_device.active_meas_p = NULL;
    
    for (i = 0; i < (int)HADM_MAX_NB_ANTENNAS; i++)
    {
        hadm_device.ant2gpio[i] = 0U;
    }

    hadm_device.rccal_manual_override_needed = FALSE;
    hadm_device.rtt_static_comp.rttRCcal = HADM_RCCAL_CENTER;
    hadm_device.rtt_static_comp.rttCbpfAtt[HADM_RTT_PHY_1MBPS] = HADM_CBPF_ATTEN_CENTER_1MBPS;
    hadm_device.rtt_static_comp.rttCbpfAtt[HADM_RTT_PHY_2MBPS] = HADM_CBPF_ATTEN_CENTER_2MBPS;

    /* Set default PA ramping duration and antenna switching mode. Can be overwritten via vendor HCI command. */
    hadm_device.paRampingTime = XCVR_RSM_PA_RAMP_1_USEC;
    hadm_device.paRampingAntSwitchEnabled = false;

    /* Perform initial calibration */
    hadm_device.is_rsm_cal_done = false;

#ifndef SIMULATOR
    hal_status = lcl_hadm_calibrate_dcoc(HADM_RTT_PHY_1MBPS);
    if (hal_status == HADM_HAL_SUCCESS)
    {
        hal_status = lcl_hadm_calibrate_dcoc(HADM_RTT_PHY_2MBPS);
    }
    if (hal_status == HADM_HAL_SUCCESS)
    {
        hal_status = lcl_hadm_calibrate_pll(HADM_RTT_PHY_1MBPS);
    }
    if (hal_status == HADM_HAL_SUCCESS)
    {
        hal_status = lcl_hadm_calibrate_pll(HADM_RTT_PHY_2MBPS);
    }

    /* Read CBPF filter data from IFR - needed to compute internal RTT delay */
    {
        rf_ifr_rtt_trim_t rtt_trim_values;

        if (XCVR_TRIM_ReadRttIfr(&rtt_trim_values))
        {
            if (rtt_trim_values.rf_rtt_tg_trim_rccal != RTT_TRIM_TG_RCCAL_WIDTH_MASK)
            {
                hadm_device.rccal_manual_override_needed = TRUE;
                hadm_device.rtt_static_comp.rttRCcal = rtt_trim_values.rf_rtt_tg_trim_rccal;
                hadm_device.rtt_static_comp.rttCbpfAtt[HADM_RTT_PHY_1MBPS] = rtt_trim_values.rf_rtt_tg_attenuation_1mbps;
            }
            if (rtt_trim_values.rf_rtt_tg_attenuation_2mbps != RTT_TRIM_TG_ATTEN_WIDTH_MASK)
            {
                hadm_device.rtt_static_comp.rttCbpfAtt[HADM_RTT_PHY_2MBPS] = rtt_trim_values.rf_rtt_tg_attenuation_2mbps;
            }
        }
        else
        {
            /* Default values will be used */
        }
    }

    if (hal_status == HADM_HAL_SUCCESS)
#endif
    {
        hadm_device.is_rsm_cal_done = true;
    }

    /* Initialize RTT compensation for device contributors */
    lcl_hadm_utils_calc_rtt_static_delay(&hadm_device);

    /* Initialize temperature compensation (assume 25 degrees C in case the host does not inform NBU) */
    lcl_hadm_handle_temperature_change(HADM_TEMPERATURE_CENTER);

