nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    /* Initialize default value for phase rotation offset */
    lcl_hadm_init_phase_offset();

    /* Init LTC for DRBG */
    LTC_Init(LTC0);

    /* Backup TSM */
    lcl_hal_xcvr_hadm_backup();
    
    assert(hadm_device.is_rsm_cal_done == true);
    return hal_status;
}

/* This API is supposed to be called in the context of idle task */
void lcl_hadm_handle_temperature_change(int32_t temperature)
{
    OSA_DisableIRQGlobal();
    hadm_device.current_temperature = (int16_t)temperature;
    lcl_hadm_utils_calc_rtt_temperature_delay(temperature, &hadm_device);
    OSA_EnableIRQGlobal();
}

BLE_HADM_STATUS_t lcl_hadm_set_antenna_type(uint8 *antBoardTable)
{
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;
    
    for (int i = 0; i < HADM_MAX_NB_ANTENNAS; i++)
    {
        if (antBoardTable[i] <= 15U) /* max is 4 bits */
        {
            hadm_device.ant2gpio[i] = antBoardTable[i];
        }
        else
        {
           hal_status = HADM_HAL_INVALID_ARGS;
           assert(0);
           break;
        }
    }
    
    if (hal_status == HADM_HAL_SUCCESS)
    {
        LCL_HAL_SET_ANTENNA_PORT(hadm_device.ant2gpio[0]);
    }
    
    return hal_status;
}

void lcl_hadm_set_dma_debug_buffer(uint16 dma_debug_buff_size, uint32 dma_debug_buff_address)
{
    hadm_device.dma_debug_buff_size = dma_debug_buff_size;
    hadm_device.dma_debug_buff_address = dma_debug_buff_address;
}

BLE_HADM_STATUS_t lcl_hadm_calibrate_dcoc(BLE_HADM_rttPhyMode_t rate)
{   
    xcvrLclStatus_t status;
    
    DEBUG_PIN0_SET

    /* trigger calibration */
    XCVR_LCL_CalibrateDcocStart((XCVR_RSM_SQTE_RATE_T)rate);
    /* wait for results */
    status = XCVR_LCL_CalibrateDcocCompleteFine(&hadm_device.dcoc_cal_results[rate]);

    DEBUG_PIN0_CLR

    return (status == gXcvrLclStatusSuccess ? HADM_HAL_SUCCESS : HADM_HAL_FAIL);
}

BLE_HADM_STATUS_t lcl_hadm_calibrate_pll(BLE_HADM_rttPhyMode_t rate)
{   
    xcvrLclStatus_t status = gXcvrLclStatusSuccess;
    XCVR_RSM_SQTE_RATE_T xcvr_rate = (XCVR_RSM_SQTE_RATE_T)rate;
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;

    DEBUG_PIN0_SET

    /* Backup PLL config */
    lcl_hal_xcvr_pll_settings_backup();

#ifdef HADM_PLL_CAL_INTERPOLATION
    uint16_t chan40_ovrd;
    /* Trigger manual calibration on channel 40 */
    (void)XCVR_LCL_MakeChanNumFromHadmIndex(40 /* 2442 MHz */, &chan40_ovrd);
    DEBUG_PIN1_SET
    status = XCVR_LCL_CalibratePll((const channel_num_t *)&chan40_ovrd, (xcvr_lcl_pll_cal_data_t *)&hadm_device.cal_ch40[rate], 1U, false, xcvr_rate);
    DEBUG_PIN1_CLR
#else

    /* Trigger manual calibration on all channels */
    uint16_t chan;
    uint16_t fstep_chan_num_ovrd[HADM_MAX_CHANNELS] = {0U};
    for (chan=0; chan < HADM_MAX_CHANNELS; chan++)
    {
        status += XCVR_LCL_MakeChanNumFromHadmIndex(chan, &fstep_chan_num_ovrd[chan]);
    }
    DEBUG_PIN1_SET
    status += XCVR_LCL_CalibratePll(fstep_chan_num_ovrd, (xcvr_lcl_pll_cal_data_t *)&hadm_device.cal_data[rate], HADM_MAX_CHANNELS, false, xcvr_rate);
    DEBUG_PIN1_CLR
#endif
    
    /* Restore PLL config */
    lcl_hal_xcvr_pll_settings_restore();

    if (gXcvrLclStatusSuccess == status)
    {
        /* Mark calibration as available */
        hal_status = HADM_HAL_SUCCESS;
    }
    else
    {
        hal_status = HADM_HAL_FAIL;
    }

    DEBUG_PIN0_CLR

    return hal_status;
}

const BLE_HADM_HalProperties_t *lcl_hadm_get_properties(void)
{
    return &hadm_hal_properties;
}

void lcl_hadm_get_preparation_timings(const BLE_HADM_SubeventConfig_t *hadm_config_p,
                                      uint16_t *prepare_time,
                                      uint16_t *warmup_time,
                                      uint16_t *warmdown_time)
{
    /* prepare_time */
    *prepare_time = HADM_HAL_PREPARE_US;
 
    /* warmup_time */
    if (hadm_config_p->role == HADM_ROLE_INITIATOR)
    {
        *warmup_time = hadm_hal_properties.txWarmupUs;
    }
    else
    {
        *warmup_time = hadm_hal_properties.rxWarmupUs;
    }
    if ((HADM_IS_RSM_OPTIM_INACTIVE(hadm_config_p)) ||
        (hadm_config_p->subeventIdx == 0U))
    {
        *warmup_time += HADM_HAL_RSM_TRIGGER_DELAY;
    }
    else
    {
        *warmup_time += HADM_HAL_RSM_TRIGGER_DELAY_OPTIM;
    }

    /* warmdown_time */
    *warmdown_time = 0;
}

const BLE_HADM_HalCapabilities_t *lcl_hadm_get_capabilities(void)
{
    return &hadm_hal_capabilities;
}

BLE_HADM_STATUS_t lcl_hadm_check_config(const BLE_HADM_SubeventConfig_t *hadm_config)
{   
    if((hadm_config->stepsNb > HADM_MAX_NB_STEPS) || (hadm_config->stepsNb < HADM_MIN_NB_STEPS))
    {   goto config_error; }

    if (hadm_config->chModePmAntMap[0].mode != 0U) /* First step shall be mode 0 */
    {   goto config_error; }
    
    if (hadm_config->T_PM_Time > HADM_T_PM_40)
    {   goto config_error; }
    
    if ((hadm_config->toneAntennaConfigIdx == HADM_ANT_CFG_IDX_0) && (hadm_config->T_SW_Time != HADM_T_SW_0)) /* N_AP=1 => T_SW=0 */
    {   goto config_error; }
        
    if ((hadm_config->toneAntennaConfigIdx != HADM_ANT_CFG_IDX_0) && (hadm_config->T_SW_Time < HADM_T_SW_2)) /* only T_SW >1us is supported */
    {   goto config_error; }

    if ((hadm_config->rttAntennaID == 0U) || ((hadm_config->rttAntennaID > HADM_MAX_NB_ANTENNAS) && (hadm_config->rttAntennaID < HADM_RTT_ANT_ROUND_ROBIN)))
    {   goto config_error; }

    if (hadm_config->subeventIdx >= HADM_NUM_SUBEVENTS_MAX)
    {   goto config_error; }
    
    if (hadm_config->connIdx >= HADM_MAX_NB_CONNECTIONS)
    {   goto config_error; }

    return HADM_HAL_SUCCESS;
    
config_error:
    return HADM_HAL_INVALID_ARGS;
}

/* Make sure the execution of this function is not disruptive on any HW module (RSM, TSM, LCL, etc.) as it might be called while */
/* another measuremnt instance is running */
BLE_HADM_STATUS_t lcl_hadm_configure(const BLE_HADM_SubeventConfig_t *hadm_config)
{
    uint32_t i;
    xcvrLclStatus_t status;
    hadm_meas_t *hadm_meas_p = lcl_hadm_alloc_meas_instance();
    assert(NULL != hadm_meas_p);
    xcvr_lcl_rsm_config_t *rsm_config_p = &hadm_meas_p->rsm_config;
    uint16_t mode0_timeout_usec;

