nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    return status;
}

/*!
 * This function is used to read available subevent steps results from PKT RAM Results circular buffer
 * and format results directly in HCI format into hadm_result_buff_desc buffer.
 * This is called on RSM step interrupt IRQ or RSM EOS
 * RSM overflow is checked
 * if n_steps_required==0, all available results will be read
 * Note: instead of passing the number of steps to process we should rather rely on PKTRAM circular buffer to detect end of available steps,
 * but this pointer is not reliable on KW47 as it is flushed right after EOS (HW bug fixed on next generations)
 */
static BLE_HADM_STATUS_t lcl_hadm_get_step_results(uint16 n_steps_required, hadm_meas_t *hadm_meas_p)
{
    hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_result;
    BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p = &hadm_meas_p->config_p->chModePmAntMap[circ_buff_p->curr_step_idx];
    hadm_info_t *hadm_info_p = &hadm_meas_p->info;
    hadm_proc_t *hadm_proc_p = &hadm_procs[hadm_meas_p->config_p->connIdx];
    uint8_t *res_buff1_p;
    uint8_t *res_buff1_in_p;
    uint8_t *res_buff2_in_p;
    uint8_t *res_buff2_p;
    uint8_t *res_buff_p;
    uint8_t nb_steps = 0;
    uint8_t step_mode0_no = 0;
    uint8_t rtt_pkt_no = 0;
    /* A sniffer will be reported as an initiator for both devices */
    BLE_HADM_role_t role = (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER) ? HADM_ROLE_INITIATOR : hadm_meas_p->config_p->role;
    bool_t synch_done = FALSE;
    uint32_t nb_iter;  /* Number of iterations on result records */

    uint32_t common_stat;
    uint32_t nadm_error = 0U;
    uint8_t rssi_nb;
    uint32_t rtt_data_raw;
    uint32_t tpm = 0U;  /* TPM timestamp unit is 1/32MHz */
    int ap;
    int32_t iq[HADM_MAX_NB_ANTENNA_PATHS+1U];

    assert(circ_buff_p->curr_step_idx < hadm_meas_p->config_p->stepsNb);
    
    if (circ_buff_p->curr_step_idx > 0U)
    {
        hadm_meas_p->result_p = lcl_hadm_utils_get_result_buffer();
        
        if (hadm_meas_p->result_p == NULL)
        {
#ifdef HAL_ENABLE_ASSERT_ON_STRESS
            assert(FALSE);
#endif
            return HADM_HAL_MEMORY_FULL;
        }
        hadm_meas_p->result_p->connIdx = hadm_meas_p->config_p->connIdx;
        hadm_meas_p->result_p->subeventIdx = hadm_meas_p->config_p->subeventIdx; /* echo subeventIdx */
    }
    hadm_meas_p->result_p->firstStepCollected = circ_buff_p->curr_step_idx;

    DEBUG_PIN1_SET

    /* Prepare for NADM metric calculations */
    BLE_HADM_rttPhyMode_t rate = hadm_meas_p->config_p->rttPhy;
    uint8_t fm_corr_target;
    uint8_t fm_corr_div;
    XCVR_LCL_GetNadmMetricCalFactors((XCVR_RSM_SQTE_RATE_T)rate, (XCVR_RSM_RTT_TYPE_T)hadm_meas_p->config_p->rttTypes, fm_corr_target, fm_corr_div);

    /* Copy CFO into frequencyCompensation from procedure if initiator (already set to fixed value otherwise) */
    if (role == HADM_ROLE_INITIATOR)
    {
        uint8_t *freq_comp_p = (uint8_t *)&hadm_meas_p->result_p->frequencyCompensation;
        HADM_SET_RTT_CFO(TRUE, hadm_proc_p->ppm, freq_comp_p);
    }

    /* Compute RPL once per subevent.*/
    if (hadm_meas_p->result_p->referencePwrLevel == HADM_INVALID_REFERENCE_POWER_LEVEL)
    {
        if (hadm_proc_p->agc_idx <= 11U)
        {
            hadm_meas_p->result_p->referencePwrLevel = lcl_hal_xcvr_compute_rpl(hadm_proc_p->agc_idx);
        }
        if (hadm_proc_p->agc_idx2 <= 11U)
        {
            /* agc_idx2 only set if sniffer mode is active */
            hadm_meas_p->result_p->referencePwrLevel2 = lcl_hal_xcvr_compute_rpl(hadm_proc_p->agc_idx2);
        }
    }

    res_buff1_in_p = hadm_meas_p->result_p->resultBuffer;
    res_buff1_p = res_buff1_in_p;
    res_buff2_in_p = hadm_meas_p->result_p->resultBuffer2;
    res_buff2_p = res_buff2_in_p;

    res_buff_p = res_buff1_p;

    while (circ_buff_p->curr_step_idx < hadm_meas_p->config_p->stepsNb)
    {
        if ((hadm_meas_p->pkt_ram.result_read_ptr + circ_buff_p->max_step_size) > circ_buff_p->base_ptr + circ_buff_p->buff_len)
        {
            /* Need to wrap now: rewind write pointer to start and toggle page */
            hadm_meas_p->pkt_ram.result_read_ptr = circ_buff_p->base_ptr;
            circ_buff_p->curr_page ^= 1U;
        }

        /* Read one or two (sniffer) record */
        nb_iter = 0;
        do
        {
            /* Decode common status */
            common_stat = *hadm_meas_p->pkt_ram.result_read_ptr++;
            assert(circ_buff_p->curr_step_idx == (common_stat & COM_RES_HDR_STEP_ID_STEP_ID_MASK)); /* HW and SW step_id should be aligned! */

            if (LCL_HAL_GET_PKT_RAM_COM_RES_HDR_TIME_DRIFT(common_stat) != 0U)
            {
                hadm_info_p->num_time_adj++; /* record time_adj for debug */
            }

            /* Decode packet status if present */
            if (step_config_p->mode != HADM_STEP_MODE2)
            {
#if defined(NXP_RADIO_GEN) && (NXP_RADIO_GEN == 470)
                rssi_nb = (hadm_meas_p->pkt_ram.result_read_ptr[0U] & COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RSSI_NB_MASK) >> COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RSSI_NB_SHIFT;
#else
                rssi_nb = (hadm_meas_p->pkt_ram.result_read_ptr[2U] & 0xFF0000U) >> 16U;
#endif
                nadm_error = *hadm_meas_p->pkt_ram.result_read_ptr++;
                rtt_data_raw = *hadm_meas_p->pkt_ram.result_read_ptr;
                hadm_meas_p->pkt_ram.result_read_ptr += 2U; /* skip cfo_est */
                tpm = *hadm_meas_p->pkt_ram.result_read_ptr++;
#ifdef RTT_DEBUG
                rtt_tpm_dbg_buffer[circ_buff_p->curr_step_idx] = tpm;
                rtt_common_stat_dbg_buffer[circ_buff_p->curr_step_idx] = common_stat & 0x30000000U;
#endif
            }

            /* Decode tone status if present */
            if (step_config_p->mode >= HADM_STEP_MODE2)
            {
                for (ap = 0; ap <= (int)hadm_meas_p->n_ap; ap++)
                {
                    iq[ap] = *hadm_meas_p->pkt_ram.result_read_ptr++;
                }
            }

            /* Store Step_Data "header" */
            *res_buff_p++ = (uint8_t)step_config_p->mode; /* Step_Mode */
            *res_buff_p++ = (uint8_t)step_config_p->channel; /* Step_Channel */

