nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
        if (step_config_p->mode != HADM_STEP_MODE2)
        {
            if (++hadm_meas_p->data_in_flight_r_idx >= HADM_HAL_PKT_RAM_IN_FLIGHT_DATA_BUFFER_SIZE)
            {
                hadm_meas_p->data_in_flight_r_idx = 0;
            }
        }
        circ_buff_p->curr_step_idx++;
        step_config_p++;
        nb_steps++;
        
        if (nb_steps == n_steps_required)
        {
            break;
        }
    }
    
    hadm_meas_p->result_p->nbStepsCollected = nb_steps;
    assert((res_buff1_p - res_buff1_in_p) <= hadm_meas_p->result_p->resultBufferSize); /* check we did not write out of bounds */
    assert((res_buff2_p - res_buff2_in_p) <= hadm_meas_p->result_p->resultBufferSize); /* check we did not write out of bounds */
    
    LCL_HAL_UPDATE_PKT_RAM_RESULT_STEP_PTR(circ_buff_p->curr_page, hadm_meas_p->pkt_ram.result_read_ptr);
    
    DEBUG_PIN1_CLR

    return HADM_HAL_SUCCESS;
}

/* RSM_INT_IRQ Handler */
void RSM_INT_IRQHandler(void)
{
    BLE_HADM_event_type_t type = HADM_EVENT_INVALID;
    uint32_t irq_status = LCL_HAL_RSM_GET_IRQ_STATUS_FLAGS;
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;
    hadm_meas_t *hadm_meas_p = hadm_device.active_meas_p;
    uint32_t abort_reason = 0;
    
    DEBUG_PIN0_SET

    assert(hadm_meas_p != NULL);
    assert(hadm_meas_p->config_p != NULL);
    assert(hadm_meas_p->result_p != NULL);
    assert((hadm_meas_p->state == HADM_HAL_MEAS_STATE_RUNNING) || (hadm_meas_p->state == HADM_HAL_MEAS_STATE_ABORTING));

    if (hadm_meas_p->state == HADM_HAL_MEAS_STATE_ABORTING)
    {
        /* Aborted by user */
        type = HADM_EVENT_EOS;
        hal_status = HADM_HAL_STOPPED;
    }
    else if ((irq_status & LCL_HAL_XCVR_RSM_IRQ_ABORT) != 0U)
    {
        /* RSM has aborted */
        type = HADM_EVENT_EOS;
        abort_reason = XCVR_MISC->RSM_CSR & (XCVR_MISC_RSM_CSR_RSM_PLL_ABORT_MASK | XCVR_MISC_RSM_CSR_RSM_UNDR_ERR_MASK | XCVR_MISC_RSM_CSR_RSM_OVF_ERR_MASK | XCVR_MISC_RSM_CSR_RSM_TIMEOUT0_ABORT_MASK);
        
        if ((abort_reason & XCVR_MISC_RSM_CSR_RSM_TIMEOUT0_ABORT_MASK) != 0U)
        {
            hal_status = HADM_HAL_ABORTED_SYNC;
        }
        else if (((abort_reason & XCVR_MISC_RSM_CSR_RSM_UNDR_ERR_MASK) != 0U) &&
                 (!hadm_meas_p->mode0_complete))
        {
            /* KW47 HW bug workaround on reflector: when mode0 retry is enabled, there's a small
             * probability that the RSM does not send an abort IRQ in case the last mode0 is
             * received (AA match) just after transitioning to 1st non_mode0 step.
             * In this case, the condition is detected by an RSM underrun on 2nd non-mode0 step.
             * This situation should be avoided by the LL ensuring that mode0 timeout
             * is only enabled when devices are properly synchronized (small window widening).
             * Note: when this occurs there's a dummy transmission for the 1st non-mode0 step.
             */
            hal_status = HADM_HAL_ABORTED_SYNC;
        }
        else  /* should not occur */
        {
            assert(FALSE);
            hal_status = HADM_HAL_ABORTED;
        }
    }
    else if ((irq_status & LCL_HAL_XCVR_RSM_IRQ_EOS) != 0U)
    {
        /* End Of Sequence */
        type = HADM_EVENT_EOS;

        /* Pull remaining steps results */
        if (hadm_meas_p->pkt_ram.step_result.curr_step_idx < hadm_meas_p->config_p->stepsNb)
        {
            hal_status = lcl_hadm_get_step_results(0, hadm_meas_p);
            assert(hadm_meas_p->data_in_flight_w_idx == hadm_meas_p->data_in_flight_r_idx);
        }
    }
    else
    {
        if ((irq_status & LCL_HAL_XCVR_RSM_IRQ_FM) != 0U)
        {
            /* Mode 0 interrupt */
            hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_result;
            uint32_t *rsm_result_ptr;
            bool_t aa_det;
            uint32_t mode0_index = circ_buff_p->curr_step_idx;
            uint32_t mode0_step_size = LCL_HAL_PKT_RAM_STEP_RESULT_MODE01_SIZE;
            if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
            {
                /* 2nd result */
                mode0_step_size *= HADM_SNIFFER_DEVICE_NB;
            }

            do
            {
                rsm_result_ptr = circ_buff_p->base_ptr + (mode0_index * mode0_step_size);
                aa_det = lcl_hal_xcvr_decode_mode0_step(hadm_meas_p->sync_info, rsm_result_ptr, (uint8_t)hadm_meas_p->config_p->rttPhy);
                if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
                {
                    /* Read 2nd result */
                    rsm_result_ptr += LCL_HAL_PKT_RAM_STEP_RESULT_MODE01_SIZE;
                    (void)lcl_hal_xcvr_decode_mode0_step(hadm_meas_p->sync_info2, rsm_result_ptr, (uint8_t)hadm_meas_p->config_p->rttPhy);
                }
                mode0_index++;
            } while ((hadm_meas_p->config_p->role == HADM_ROLE_REFLECTOR) && (aa_det == FALSE) && (circ_buff_p->curr_step_idx == 0U)); /* first mode 0 was missed, go to next */
            circ_buff_p->curr_step_idx = (uint8_t)mode0_index;

            if (circ_buff_p->curr_step_idx == hadm_meas_p->config_p->mode0Nb)
            {
                /* Last mode 0 has been received */
                hal_status = lcl_hadm_handle_last_mode0(hadm_meas_p);
                if (hal_status != HADM_HAL_SUCCESS)
                {
                    type = HADM_EVENT_EOS;
                    /* Abort Subevent */
                    lcl_hadm_measurement_shutdown(hadm_meas_p, TRUE);
                }
                else
                {
                    type = HADM_EVENT_SYNC_DONE;
                    if (hadm_meas_p->pkt_ram.step_config.curr_step_idx < hadm_meas_p->config_p->stepsNb)
                    {
                        /* Push more config steps if needed */
                        (void)lcl_hadm_set_steps_config(hadm_meas_p->pkt_ram.nb_steps_before_irq, hadm_meas_p, TRUE);
                    }
                }
                circ_buff_p->curr_step_idx = 0; /* reset current read index to process results in next step interrupt */
            }
        }
        else if ((irq_status & LCL_HAL_XCVR_RSM_IRQ_STEP) != 0U)
        {
            if (!hadm_meas_p->mode0_complete)
            {
                /* postpone mode0 processing as we need CFO and AGC to be frozen before reporting to LL */
                type = HADM_EVENT_INVALID;
                hadm_meas_p->pkt_ram.nb_irq_steps_postponed++;
            }
            else
            {
                uint32_t steps_to_process; /* HW workaround, see note in lcl_hadm_get_step_results */
                bool_t shorten_last_step_processing = FALSE;

                /* Step interrupt */
                if (hadm_meas_p->pkt_ram.step_config.curr_step_idx < hadm_meas_p->config_p->stepsNb)
                {
                    /* Push more config steps if needed */
                    (void)lcl_hadm_set_steps_config(hadm_meas_p->pkt_ram.nb_steps_before_irq, hadm_meas_p, TRUE);
                }
                else
                {
                    shorten_last_step_processing = TRUE;
                }
                DEBUG_PIN0_PULSE
                /* Read available step results */
                if ((hadm_meas_p->pkt_ram.nb_irq_steps_handled == 0U) &&
                    (hadm_meas_p->pkt_ram.nb_steps_before_irq < hadm_meas_p->config_p->mode0Nb))
                {
                    /* Process postponed IRQ plus current one */
                    steps_to_process = (hadm_meas_p->pkt_ram.nb_irq_steps_postponed + 1U) * hadm_meas_p->pkt_ram.nb_steps_before_irq;
                }
                else
                {
                    steps_to_process = hadm_meas_p->pkt_ram.nb_steps_before_irq;
                }
                hal_status = lcl_hadm_get_step_results(steps_to_process, hadm_meas_p);
                if (shorten_last_step_processing)
                {
                    /* We are close to EOS, set one step per interrupt to minimize EOS processing latency */
                    hadm_meas_p->pkt_ram.nb_steps_before_irq = 1;
                    lcl_hal_pkt_ram_config_rsm_int_nbstep(hadm_meas_p->pkt_ram.nb_steps_before_irq);
                }
                if (hal_status == HADM_HAL_SUCCESS)
                {
                    type = HADM_EVENT_STEP_INT;
                }
                else
                {
#ifdef HAL_ENABLE_ASSERT_ON_STRESS
                    assert(false);
#endif
                    type = HADM_EVENT_EOS;
                }
                hadm_meas_p->pkt_ram.nb_irq_steps_handled++;
            }
        }
    }

    if (type == HADM_EVENT_EOS)
    {
        /* Stop or abort Subevent */
        lcl_hadm_measurement_shutdown(hadm_meas_p, hal_status != HADM_HAL_SUCCESS);
        
         /* Perform post-capture remaining actions:
         *   - Populate hadm_info fields related to mode 0
         *   - Populate debug flags
         */
        hadm_proc_t *hadm_proc_p = &hadm_procs[hadm_meas_p->config_p->connIdx];
        hadm_info_t *hadm_info_p = &hadm_meas_p->info;
        if (hadm_info_p->sync_step_id < HADM_MAX_NB_STEPS_MODE0) 
        {
            hadm_sync_info_t *sync_info_p = &hadm_meas_p->sync_info[hadm_info_p->sync_step_id];
            hadm_info_p->sync_rssi = sync_info_p->rssi;
            hadm_info_p->sync_cfo = hadm_proc_p->cfo;
            hadm_info_p->sync_rxgain = hadm_proc_p->agc_idx;
        }

        if (hadm_proc_p->agc_idx > LCL_HAL_XCVR_AGC_INDEX_MAX)
        {   hadm_info_p->flags |= FLAGS_HADM_AGC_NOT_FROZEN; }

        if (hadm_info_p->sync_rssi < -93)
        {   hadm_info_p->flags |= FLAGS_HADM_NO_SIGNAL; }
        
        if (hal_status == HADM_HAL_ABORTED_SYNC)
        {   hadm_info_p->flags |= FLAGS_HADM_SYNC_ERROR; }
        else if (hal_status == HADM_HAL_ABORTED)
        {
            hadm_info_p->flags |= FLAGS_HADM_ABORT;
            hadm_info_p->flags |= (abort_reason << 2U) & FLAGS_HADM_RSM_ABORT_REASON;
        }
    }
    
    if (((hadm_meas_p->debug_flags & HADM_DBG_FLG_DBG_INFO) != 0) &&
        (hadm_meas_p->pkt_ram.step_result.curr_step_idx == hadm_meas_p->config_p->stepsNb))
    {
        /* On KW47, just report hadm_info_t for debug. Done in the last reported event. */
        hadm_meas_p->result_p->debugBuffer = (uint8_t *)&hadm_meas_p->info;
        hadm_meas_p->result_p->debugBufferSize = sizeof(hadm_info_t);
    }

